# -*- coding: UTF-8 -*-
# ----------------------------------------知识点------------------------------------------------------
# 所谓输入,就是用代码获取 用户通过 键盘输入的信息
# 字符串变量 = input("提示信息：")   用户输入的任何内容 Python 都认为是一个 字符串
# 可以通过转换函数将输入的数据转换成你期待的数据类型
# 例如:int(x) 将字符串x转换成int类型 float(x) 将字符串x转换成float类型

if __name__ == '__main__':

    # ----------------------------------------练习------------------------------------------------------
    '''
    需求
    - 收银员输入 苹果的价格，单位：元／斤
    - 收银员输入 用户购买苹果的重量，单位：斤
    - 计算并且 输出 付款金额
    '''

    # 1. 输入苹果单价
    price_str = input("请输入苹果价格：")

    # 2. 要求苹果重量
    weight_str = input("请输入苹果重量：")

    # 3. 计算金额
    # 1> 将苹果单价转换成小数
    price = float(price_str)

    # 2> 将苹果重量转换成小数
    weight = float(weight_str)

    # 3> 计算付款金额
    money = price * weight
    money = str(money)                  # 只有字符串可以和字符串相连接,字符串和float不可以用+连接  （python和java的区别之处）
    print("付款金额为:" + money)

    print("-----------------------------------简化----------------------------------------------")

    # 1. 输入苹果单价
    price = float(input("请输入苹果价格："))

    # 2. 要求苹果重量
    weight = float(input("请输入苹果重量："))

    # 3> 计算付款金额
    money = str(price * weight)

    print("付款金额为:" + money)  # 只有字符串可以和字符串相连接,字符串和float不可以用+连接