# -*- coding: UTF-8 -*-
# ----------------------------------------知识点------------------------------------------------------
# 在 Python 中，每个变量 在使用前都必须赋值，变量赋值以后 该变量才会被创建
# 等号（=）用来给变量赋值
# = 左边是一个变量名,右边是存储在变量中的值
# 变量名 = 值

# ----------------------------------------练习------------------------------------------------------
# 定义 qq 号码变量
qq_num = "12345"
# 在程序中，如果要输出变量的内容，需要使用 print 函数
print(qq_num)

qq_pwd = "67890"
print(qq_pwd)

print("-" * 50)
# ----------------------------超市买苹果案例--------------------------------
# 需求:
# 苹果的价格是 8.5 元/斤
# 买了 7.5 斤 苹果
# 计算付款金额

# 定义苹果价格变量
price = 8.5

# 定义购买重量
weight = 7.5

# 计算金额
money = price * weight

print(money)